Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: For SI: 1 inch = 25.4 mm.
fr_ca: Pour le SI : 1 pouce = 25,4 mm.

source: For SI: 1 inch = 25.4 mm
fr_ca: Pour SI : 1 pouce = 25,4 mm

source: For SI: 1 inch = 25.4 mm, 1 foot = 304.8 mm, 1 square foot = 0.0929 m2.
fr_ca: Pour le SI : 1 pouce = 25,4 mm, 1 pied = 304,8 mm, 1 pied carré = 0,0929 m 2.

source: For Type B units, clear floor spaces shall be 48 inches (1220 mm) minimum in length and 30 inches (760 mm) minimum in width.
fr_ca: Pour les unités de type B, les surfaces de plancher dégagées doivent être d'au moins 48 po (1220 mm) en longueur et d'au moins 30 po (760 mm) en largeur.

source: For a classroom with a volume between 10,000 cubic feet (285 m3) and 20,000 cubic feet (565 m3):
fr_ca: Pour une salle de classe dont le volume est compris entre 10 000 pi3 (285 m3) et 20 000 pi3 (565 m3) :

source: For a classroom with a volume less than or equal to 10,000 cubic feet (285 m3):
fr_ca: Pour une salle de classe d'un volume inférieur ou égal à 10 000 pieds cubes (285 m3) :

source: For all glazing types, the minimum nominal thickness shall be 1/4 inch (6.4 mm).
fr_ca: Pour tous les types de vitrage, l’épaisseur nominale minimale doit être de 1/4 po (6,4 mm).

source: For areas serving not more than 50 occupants, the common path of egress travel shall not exceed 75 feet (22 860 mm).
fr_ca: Pour les zones desservant au plus 50 personnes, le parcours commun d'accès à l'issue ne doit pas dépasser 75 pi (22 860 mm).

source: For balconies, galleries or press boxes having a seating capacity of 50 or more located in a building, room or space used for assembly purposes, not less than two means of egress shall be provided, with one from each side of every balcony, gallery or press box.
fr_ca: Pour les balcons, les galeries ou les loges de presse ayant une capacité de sièges de 50 personnes ou plus et situés dans un bâtiment, une salle ou un espace utilisé à des fins d’assemblée, au moins deux moyens d’évacuation doivent être prévus, dont un de chaque côté de chaque balcon, galerie ou loge de presse.

source: For bathtubs with permanent seats, grab bars complying with Section 607.4.1 shall be provided.
fr_ca: Pour les baignoires avec sièges permanents, il faut prévoir des barres d'appui conformes à la section 607.4.1.

source: For bathtubs with removable seats, grab bars complying with Section 607.4.2 shall be provided.
fr_ca: Pour les baignoires à sièges amovibles, il faut prévoir des barres d'appui conformes à la section 607.4.2.

source: For buildings in flood hazard areas as established in Section 1612.3, interior finishes, trim and decorative materials below the elevation required by Section 1612 shall be flood-damage-resistant materials.
fr_ca: Pour les bâtiments situés dans des zones à risque d’inondation établies conformément à la section 1612.3, les matériaux de finition intérieure, les éléments de finition et les matériaux décoratifs situés sous l’élévation exigée par la section 1612 doivent être des matériaux résistants aux dommages causés par les inondations.

source: For buildings not greater than 420 feet (128 m) in building height, the fire-resistance rating of the building elements in Type IA construction shall be permitted to be reduced to the minimum fire-resistance ratings for the building elements in Type IB.
fr_ca: Pour les bâtiments dont la hauteur ne dépasse pas 420 pieds (128 m), le degré de résistance au feu des éléments du bâtiment de construction de type IA peut être réduit aux degrés de résistance au feu minimaux applicables aux éléments du bâtiment de construction de type IB.

source: For buildings not greater than 420 feet (128 m) in building height, the required fire-resistance rating of the fire barriers enclosing vertical shafts, other than interior exit stairway and elevator hoistway enclosures, is permitted to be reduced to 1 hour where automatic sprinklers are installed within the shafts at the top and at alternate floor levels.
fr_ca: Pour les bâtiments dont la hauteur ne dépasse pas 420 pieds (128 m), le degré de résistance au feu requis des barrières coupe-feu qui entourent les puits verticaux, à l’exception des cages d’escaliers d’issue intérieurs et des gaines d’ascenseur, peut être réduit à 1 heure lorsque des gicleurs automatiques sont installés à l’intérieur des puits, au sommet de ceux-ci et à des niveaux d’étage alternés.

source: For buildings other than Group R-2 and their ancillary spaces that are more than 420 feet (128 m) in building height, one additional interior exit stairway meeting the requirements of Sections 1011 and 1023 shall be provided in addition to the minimum number of exits required by Section 1006.3.
fr_ca: Pour les bâtiments autres que ceux du groupe R-2 et leurs espaces accessoires dont la hauteur du bâtiment est supérieure à 420 pieds (128 m), un escalier intérieur supplémentaire menant à l’issue et conforme aux exigences des sections 1011 et 1023 doit être prévu en plus du nombre minimal d’issues exigé par la section 1006.3.

source: For chimneys more than 40 inches (1016 mm) wide, two additional No. 4 vertical bars shall be provided for each additional flue incorporated into the chimney or for each additional 40 inches (1016 mm) in width or fraction thereof.
fr_ca: Pour les cheminées d'une largeur supérieure à 40 po [1016 mm], deux barres verticales n° 4 supplémentaires doivent être prévues pour chaque conduit supplémentaire incorporé dans la cheminée ou pour chaque 40 po [1016 mm] supplémentaire de largeur ou fraction de celle-ci.

source: For chimneys up to 40 inches (1016 mm) wide, four No. 4 continuous vertical bars shall be placed between wythes of solid masonry or within the cells of hollow unit masonry and grouted in accordance with Section R606.
fr_ca: Pour les cheminées d'une largeur maximale de 40 po [1016 mm], quatre barres verticales continues n° 4 doivent être placées entre les assises de maçonnerie pleine ou à l'intérieur des cellules de maçonnerie à éléments creux et jointoyées selon la section R606.

source: For concrete foundations, any required forms shall be in place prior to inspection.
fr_ca: Pour les fondations en béton, tous les coffrages requis doivent être en place avant l’inspection.

source: For determining compliance with Section 915.1.5, an open parking garage complying with Section 406.5 or an enclosed parking garage complying with Section 406.6 shall not be considered a private garage.
fr_ca: Pour déterminer la conformité à la section 915.1.5, un garage de stationnement ouvert conforme à la section 406.5 ou un garage de stationnement fermé conforme à la section 406.6 ne doit pas être considéré comme un garage privé.

source: For each of the octave frequency bands with center frequencies of 500, 1000, and 2000 Hz, the reverberation time (T60) shall not exceed the times specified below:
fr_ca: Pour chacune des bandes de fréquences d'octave avec des fréquences centrales de 500, 1 000 et 2 000 Hz, le temps de réverbération (T60) ne doit pas dépasser les temps spécifiés ci-dessous :

source: For front loading machines, the centerline of the clear floor space shall be offset 24 inches (610 mm) maximum from the centerline of the door opening.
fr_ca: Pour les machines à chargement frontal, la ligne d'axe de la surface de plancher dégagée doit être décalée d'au plus 24 po [610 mm] de la ligne d'axe de l'ouverture de la porte.

source: For high-rise buildings of Risk Category III or IV in accordance with Section 1604.5, and for all buildings that are more than 420 feet (128 m) in building height, enclosures for interior exit stairways and elevator hoistway enclosures shall comply with Sections 403.2.2.1 through 403.2.2.4.
fr_ca: Pour les bâtiments de grande hauteur des catégories de risque III ou IV conformément à l’article 1604.5, ainsi que pour tous les bâtiments dont la hauteur dépasse 420 pi (128 m), les enceintes des escaliers d’issue intérieurs et les cages d’ascenseur doivent être conformes aux articles 403.2.2.1 à 403.2.2.4.

source: For installations in existing buildings, elevator cars that provide a clear floor area of 15 square feet (1.4 m2) minimum, and provide a clear inside dimension of 36 inches (915 mm) minimum in width and 54 inches (1370 mm) minimum in depth, shall be permitted.
fr_ca: Pour les installations dans des bâtiments existants, les cabines d'ascenseur qui offrent une surface de plancher libre d'au moins 15 pi2 [1,4 m2] et des dimensions intérieures libres d'au moins 36 po [915 mm] en largeur et 54 po [1370 mm] en profondeur sont autorisées.

source: For installations in existing buildings, elevator cars that provide a clear width of 51 inches (1295 mm) minimum, a clear depth of 51 inches (1295 mm) minimum and car doors providing a clear opening 36 inches (915 mm) wide minimum shall be permitted.
fr_ca: Pour les installations dans des bâtiments existants, les cabines d'ascenseur qui offrent une largeur libre d'au moins 51 po [1295 mm], une profondeur libre d'au moins 51 po [1295 mm] et des portes de cabine offrant une ouverture libre d'au moins 36 po [915 mm] de largeur sont autorisées.

source: For insulating glass units, all panes shall be tempered glass.
fr_ca: Pour les unités de vitrage isolant, toutes les vitres doivent être en verre trempé.

source: For landings of shapes other than square or rectangular, the depth at the walk line and the total area shall be not less than that of a quarter circle with a radius equal to the required landing width.
fr_ca: Pour les paliers de formes autres que carrées ou rectangulaires, la profondeur au niveau de la ligne de marche et la superficie totale ne doivent pas être inférieures à celles d'un quart de cercle dont le rayon est égal à la largeur requise du palier.

source: For new construction, carbon monoxide alarms shall be provided in dwelling units where either or both of the following conditions exist.
fr_ca: Pour les nouvelles constructions, des détecteurs de monoxyde de carbone doivent être prévus dans les logements où l'une ou les deux conditions suivantes existent.

source: For occupancies in other than Group I-2, exterior exit stairways and ramps shall be permitted as an element of a required means of egress for buildings not exceeding six stories above grade plane or that are not high-rise buildings.
fr_ca: Pour les usages autres que ceux du groupe I-2, les escaliers et rampes d’issue extérieurs peuvent être utilisés comme élément d’un moyen d’évacuation exigé pour les bâtiments ne comportant pas plus de six étages au-dessus du plan de référence ou qui ne sont pas des bâtiments de grande hauteur.

source: For other than Accessible, Type A and Type B dwelling units, the unit shall be provided with a kitchen sink, cooking appliance and refrigerator, each having a clear working space of not less than 30 inches (762 mm) in front.
fr_ca: Pour les logements autres que les logements accessibles et les logements de type A et de type B, le logement doit être pourvu d’un évier de cuisine, d’un appareil de cuisson et d’un réfrigérateur, chacun disposant d’un espace de travail libre d’au moins 30 po (762 mm) à l’avant.

source: For rows of seating served by aisles or doorways at both ends, there shall be not more than 100 seats per row.
fr_ca: Pour les rangées de sièges desservies par des allées ou des baies de porte aux deux extrémités, le nombre de sièges par rangée ne doit pas être supérieur à 100.

source: For rows of seating served by an aisle or doorway at only one end of the row, the minimum clear width of 12 inches (305 mm) between rows shall be increased by 0.6 inch (15.2 mm) for every additional seat beyond seven seats where seats have backrests or beyond 10 where seats are without backrests.
fr_ca: Pour les rangées de sièges desservies par une allée ou une baie de porte à une seule extrémité de la rangée, la largeur libre minimale de 12 po (305 mm) entre les rangées doit être augmentée de 0,6 po (15,2 mm) pour chaque siège supplémentaire au-delà de sept sièges lorsque les sièges sont munis de dossiers, ou au-delà de 10 sièges lorsque les sièges sont dépourvus de dossiers.

source: For seats with folding tablet arms, row spacing is permitted to be determined with the tablet arm in the stored position where the tablet arm when raised manually to vertical position in one motion automatically returns to the stored position by force of gravity.
fr_ca: Pour les sièges munis de tablettes-accoudoirs rabattables, il est permis de déterminer l’espacement entre les rangées lorsque la tablette-accoudoir est en position rangée, lorsque celle-ci, relevée manuellement en position verticale en un seul mouvement, revient automatiquement en position rangée sous l’effet de la gravité.

source: For seats with folding tablet arms, row spacing shall be determined with the tablet arm in the used position.
fr_ca: Pour les sièges munis de tablettes-accoudoirs rabattables, l’espacement entre les rangées doit être déterminé lorsque la tablette-accoudoir est en position d’utilisation.

source: For smoke-protected or open-air assembly seating there shall be not more than 40 seats between the two aisles and the minimum clear width shall be 12 inches (305 mm) plus 0.3 inch (7.6 mm) for each additional seat.
fr_ca: Pour les sièges pour assemblées protégés contre la fumée ou à l’air libre, il ne doit pas y avoir plus de 40 sièges entre les deux allées, et la largeur libre minimale doit être de 12 po (305 mm), plus 0,3 po (7,6 mm) pour chaque siège supplémentaire.

source: For smoke-protected or open-air assembly seating, the row length limits for a 12-inch-wide (305 mm) aisle accessway, beyond which the aisle accessway minimum clear width shall be increased, are in Table 1030.13.2.1.
fr_ca: Pour les sièges d’assemblée protégés contre la fumée ou en plein air, les limites de longueur des rangées pour une voie d’accès à une allée de 12 po (305 mm) de largeur, au-delà desquelles la largeur libre minimale de la voie d’accès à une allée doit être augmentée, sont indiquées au tableau 1030.13.2.1.

source: For special inspections, see Chapter 17.
fr_ca: Pour les inspections spéciales, voir le chapitre 17.

source: For the actual mandatory requirements of the code, see the indicated section of text.
fr_ca: Pour les exigences obligatoires réelles du code, voir la section du texte indiquée.

source: For the purpose of determining light and ventilation requirements, rooms shall be considered to be a portion of an adjoining room where not less than one-half of the area of the common wall is open and unobstructed and provides an opening of not less than one-tenth of the floor area of the interior room and not less than 25 square feet (2.3 m2).
fr_ca: Aux fins de déterminer les exigences relatives à l’éclairage et à la ventilation, les pièces doivent être considérées comme faisant partie d’une pièce adjacente lorsqu’au moins la moitié de la superficie du mur commun est ouverte et libre de toute obstruction et comporte une ouverture d’une superficie d’au moins un dixième de la superficie de plancher de la pièce intérieure et d’au moins 25 pi2 (2,3 m2).

source: For the purpose of this section, the exhaust from dwelling unit toilet rooms, bathrooms and kitchens shall not be considered as hazardous or noxious.
fr_ca: Aux fins de la présente section, l'évacuation des salles de toilettes, des salles de bain et des cuisines des unités d'habitation n'est pas considérée comme dangereuse ou nocive.

source: For the purposes of determining area limitations, height limitations and type of construction, each portion of a building separated by one or more fire walls complying with Section 706 shall be considered to be a separate building.
fr_ca: Pour déterminer les limites de superficie, les limites de hauteur et le type de construction, chaque partie d’un bâtiment séparée par un ou plusieurs murs coupe-feu conformes à la section 706 doit être considérée comme un bâtiment distinct.

source: For the purposes of this section, dimensions and dimensioned surfaces shall be exclusive of carpets, rugs or runners.
fr_ca: Aux fins de la présente section, les dimensions et les surfaces dimensionnées ne comprennent pas les tapis, les carpettes ou les moquettes.

source: For the purposes of this section, other portions of the building shall be treated as separate buildings.
fr_ca: Aux fins de la présente section, les autres parties du bâtiment doivent être traitées comme des bâtiments séparés.

source: For top loading machines, the clear floor space shall be centered on the appliance.
fr_ca: Pour les machines à chargement par le haut, la surface de plancher dégagée doit être centrée sur l'appareil.

source: Four No. 4 full-length bars for chimney up to 40″ wide.Add two No. 4 bars for each additional 40″ or fraction ofwidth or each additional flue.
fr_ca: Quatre barres n° 4 pleine longueur pour une cheminée d'une largeur maximale de 40 po. Ajoutez deux barres n° 4 pour chaque 40 po ou fraction de largeur supplémentaire ou pour chaque conduit supplémentaire.

source: Framing inspections shall be made after the roof deck or sheathing, all framing, fire-blocking and bracing are in place and pipes, chimneys and vents to be concealed are complete and the rough electrical, plumbing, heating wires, pipes and ducts are approved.
fr_ca: Les inspections de l’ossature doivent être effectuées après la mise en place de la couverture ou du revêtement de toiture, de toute l’ossature, des dispositifs coupe-feu et des contreventements, et après l’achèvement des tuyaux, cheminées et conduits d’évacuation devant être dissimulés, ainsi qu’après l’approbation des câbles, tuyaux et conduits bruts des installations électriques, de plomberie et de chauffage.

source: Fraternities and sororities
fr_ca: Fraternités et sororités

source: Front loading machines shall have the bottom of the opening to the laundry compartment 15 inches (380 mm) minimum and 36 inches (915 mm) maximum above the floor.
fr_ca: Le bas de l'ouverture du compartiment à linge des machines à chargement frontal doit se situer à une hauteur comprise entre 15 po [380 mm] et 36 po [915 mm] au-dessus du sol.

source: Fuel lines supplying a generator set inside a building shall be separated from areas of the building other than the room the generator is located in by one of the following methods:
fr_ca: Les conduites de carburant alimentant un groupe électrogène situé à l’intérieur d’un bâtiment doivent être séparées des parties du bâtiment autres que le local où se trouve le groupe électrogène par l’une des méthodes suivantes :

source: Furnishings or decorative materials of an explosive or highly flammable character shall not be used.
fr_ca: Les meubles ou les matériaux décoratifs de nature explosive ou hautement inflammable ne doivent pas être utilisés.

source: Furnishings or other objects shall not be placed to obstruct exits, access thereto, egress therefrom or visibility thereof.
fr_ca: Le mobilier ou d'autres objets ne doivent pas être placés de manière à obstruer les sorties, l'accès à celles-ci, l'évacuation par celles-ci ou leur visibilité.

source: GLAZED PANELS REGULATED BYSECTION R308.4.2(Category Class)
fr_ca: PANNEAUX VITRÉS RÉGIS PAR LA SECTION R308.4.2 (Classe de catégorie)

source: GLAZED PANELS REGULATED BYSECTION R308.4.3(Category Class)
fr_ca: PANNEAUX VITRÉS RÉGLEMENTÉS PAR LA SECTION R308.4.3 (Classe de catégorie)

source: GLAZED PANELSREGULATED BYSECTION R308.4.2(Category Class)
fr_ca: PANNEAUX VITRÉS RÉGLEMENTÉS PAR LA SECTION R308.4.2 (Classe de catégorie)

source: GLAZED PANELSREGULATED BYSECTION R308.4.3(Category Class)
fr_ca: PANNEAUX VITRÉS RÉGLEMENTÉS PAR LA SECTION R308.4.3 (Classe de catégorie)

source: GLAZING INDOORS ANDENCLOSURESREGULATED BYSECTION 308.4.5(Category Class)
fr_ca: VITRAGE À L'INTÉRIEUR ET ENCEINTES RÉGLEMENTÉS PAR LA SECTION 308.4.5 (Classe de catégorie)

source: GLAZING INDOORS(Category Class)
fr_ca: VITRAGE INTÉRIEUR (Classe de catégorie)

source: GLAZING INSTORM ORCOMBINATIONDOORS(Category Class)
fr_ca: VITRAGE DANS LES PORTES COUPE-FEU OU COMBINÉES (Classe de catégorie)

source: Gaps or breaks shall be provided at intervals not exceeding five rows to facilitate access to seating and to permit crossing from one side of the aisle to the other.
fr_ca: Des espaces ou des interruptions doivent être prévus à des intervalles ne dépassant pas cinq rangées pour faciliter l'accès aux sièges et permettre de passer d'un côté à l'autre de l'allée.

source: Gas detection system equipment shall be designed for use with the gases being detected and shall be installed in accordance with manufacturer's instructions.
fr_ca: Les équipements des systèmes de détection de gaz doivent être conçus pour être utilisés avec les gaz détectés et doivent être installés conformément aux instructions du fabricant.

source: Gas detection systems and sensors shall be inspected, tested and calibrated in accordance with the International Fire Code.
fr_ca: Les systèmes de détection de gaz et les capteurs doivent être inspectés, testés et étalonnés conformément à l'International Fire Code.

source: Gas detection systems required by this code shall comply with Sections 916.2 through 916.11.
fr_ca: Les systèmes de détection de gaz exigés en vertu du présent code doivent être conformes aux sections 916.2 à 916.11.

source: Gas detection systems shall be permanently connected to the building electrical power supply or shall be permitted to be cord connected to an unswitched receptacle using an approved restraining means that secures the plug to the receptacle.
fr_ca: Les systèmes de détection de gaz doivent être raccordés en permanence à l’alimentation électrique du bâtiment ou peuvent être raccordés par cordon à une prise de courant non commutée au moyen d’un dispositif de retenue approuvé qui fixe la fiche à la prise.

source: Gas sampling shall be performed continuously.
fr_ca: L'échantillonnage des gaz doit être effectué en continu.

source: Gas sensors and gas detection systems shall not be connected to fire alarm systems unless approved and connected in accordance with the fire alarm equipment manufacturer's instructions.
fr_ca: Les capteurs de gaz et les systèmes de détection de gaz ne doivent pas être raccordés aux systèmes d’alarme d’incendie, sauf s’ils sont approuvés et raccordés conformément aux instructions du fabricant de l’équipement d’alarme d’incendie.

source: General site and building elements required to be 504.1 General.
fr_ca: Les éléments généraux du site et du bâtiment doivent être 504.1 Généralités.

source: Give such other data and information as required by the building official.
fr_ca: Fournir les autres données et renseignements exigés par le responsable de la construction.

source: Glass guard elements shall be designed using a factor of safety of four.
fr_ca: Les éléments de garde-corps en verre doivent être conçus en utilisant un facteur de sécurité de quatre.

source: Glass installed in exterior railing in-fill panels or balusters shall be laminated glass complying with Category II of CPSC 16 CFR Part 1201 or Class A of ANSI Z97.1.
fr_ca: Le verre utilisé dans les panneaux de remplissage des rampes extérieures ou dans les balustres doit être du verre feuilleté conforme à la catégorie II de la norme CPSC 16 CFR Part 1201 ou à la classe A de la norme ANSI Z97.1.
